
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.device["R10"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "743"
      ~ name          = "tun2" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "940"
      ~ name          = "tun2" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2164"
      ~ name          = "tun1" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R10"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "25"
      ~ name               = "tun19" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R10"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "91"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "91"
    }

  # module.device["R14"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1102"
      ~ name          = "tun4" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1103"
      ~ name          = "tun4" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2159"
      ~ name          = "tun2" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R14"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "26"
      ~ name               = "tun20" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R14"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "310"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "310"
    }

  # module.device["R15"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1096"
      ~ name          = "tun3" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1097"
      ~ name          = "tun3" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2166"
      ~ name          = "tun3" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R15"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "27"
      ~ name               = "tun21" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R15"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "311"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "311"
    }

  # module.device["R18"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1689"
      ~ name          = "tun12" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1690"
      ~ name          = "tun12" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2162"
      ~ name          = "tun4" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R18"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "64"
      ~ name               = "tun24" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R18"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "418"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "418"
    }

  # module.device["R19"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1410"
      ~ name          = "tun6" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "1413"
      ~ name          = "tun6" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2161"
      ~ name          = "tun5" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R19"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "54"
      ~ name               = "tun22" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R19"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "419"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "419"
    }

  # module.device["R20"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2009"
      ~ name          = "tun13" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2131"
      ~ name          = "tun13" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2165"
      ~ name          = "tun6" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R20"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "83"
      ~ name               = "tun30" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R20"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "427"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "427"
    }

  # module.device["R21"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2260"
      ~ name          = "tun14" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R21"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2259"
      ~ name          = "tun14" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R21"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2258"
      ~ name          = "tun8" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R21"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "95"
      ~ name               = "tun32" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R21"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "428"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "428"
    }

  # module.device["R9"].netbox_device_interface.core["CR3"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "741"
      ~ name          = "tun1" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_device_interface.core["CR4"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "943"
      ~ name          = "tun1" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_device_interface.core["CR6"] will be updated in-place
  ~ resource "netbox_device_interface" "core" {
        id            = "2163"
      ~ name          = "tun7" -> (known after apply)
        tags          = []
        # (12 unchanged attributes hidden)
    }

  # module.device["R9"].netbox_interface.core["CR5"] will be updated in-place
  ~ resource "netbox_interface" "core" {
        id                 = "24"
      ~ name               = "tun18" -> (known after apply)
        tags               = []
        # (7 unchanged attributes hidden)
    }

  # module.device["R9"].random_integer.core_ifnum will be created
  + resource "random_integer" "core_ifnum" {
      + id      = (known after apply)
      + keepers = {
          + "device_id" = "90"
        }
      + max     = 10000
      + min     = 1000
      + result  = (known after apply)
      + seed    = "90"
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R10"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "5cfa6db3-afd2-40d3-9799-da4ec9693323" -> null
      - input  = 2 -> null
      - output = 2 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R14"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "497748f0-0521-48e2-bc8b-c55a5ba90049" -> null
      - input  = 4 -> null
      - output = 4 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R15"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "ae3a5b78-3b87-4492-a48c-2d968576b326" -> null
      - input  = 3 -> null
      - output = 3 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R18"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "ab741f65-f42a-4f3a-8585-c2e5896123fd" -> null
      - input  = 12 -> null
      - output = 12 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R19"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "dc0d3da1-bc86-46b2-b3a6-f82dd34d3723" -> null
      - input  = 6 -> null
      - output = 6 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R20"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "6d93b0a6-c990-4465-b0d8-9b6a2a6b517d" -> null
      - input  = 13 -> null
      - output = 13 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R21"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "63e64b8f-1acd-24b5-4d6d-375eeaba27c5" -> null
      - input  = 14 -> null
      - output = 14 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.ifnum["R9"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "e6f6d502-816f-4393-a6e1-0730d381af1f" -> null
      - input  = 1 -> null
      - output = 1 -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R10"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "293c8394-0425-acd0-9095-d2d8372d06e1" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R14"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "008484ff-b100-5410-9016-b5dd6dbf8343" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R15"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "f21fcfb8-ccee-f415-ebde-034b895b6b5f" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R18"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "92e59143-475e-9bb1-a3d6-e8209bf8dbd7" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R19"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "80115892-1b29-e656-fb43-20671ea88523" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R20"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "451cd079-d9d8-eeda-4aee-a72a90a98f15" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R21"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "f9de891b-e7f6-d8fa-45ed-758042152250" -> null
      - input  = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
      - output = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
    }

  # module.tunnel_interfaces["CR3"].terraform_data.targets_hash["R9"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "57a7bd5d-8e0b-84ec-63a4-30c8ae9ebe8a" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R10"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "52a6c8fb-ad51-4061-952b-ffb3b442c076" -> null
      - input  = 2 -> null
      - output = 2 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R14"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "f52974c3-14c9-4975-9ec7-bd4a9800665e" -> null
      - input  = 4 -> null
      - output = 4 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R15"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "f14dd909-4766-401e-94e1-394ba3f5e94c" -> null
      - input  = 3 -> null
      - output = 3 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R18"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "bf674910-ce7d-4d75-be32-9f0b78dd370c" -> null
      - input  = 12 -> null
      - output = 12 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R19"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "c8e49870-2cff-4e15-a2b2-bca60c328bcf" -> null
      - input  = 6 -> null
      - output = 6 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R20"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "bb97784e-5083-493c-a870-6e6012d75829" -> null
      - input  = 13 -> null
      - output = 13 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R21"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "d054c542-0a90-6bf7-9b4b-3cbbb01873c3" -> null
      - input  = 14 -> null
      - output = 14 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.ifnum["R9"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "917a9c8f-fd6a-4209-addd-13b1bd059acf" -> null
      - input  = 1 -> null
      - output = 1 -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R10"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "a58bfa11-a016-c391-2ad5-3eeea98d14cb" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R14"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "57f55489-46cd-8b89-2e9b-977f83f2ecd5" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R15"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "703b9152-aec3-d08b-d752-a8f2a7076269" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R18"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "45c2978f-6b5b-ff49-f5d9-e65bda1954db" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R19"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "ad73fa85-1c6d-f4db-3a45-2ad41a5cd293" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R20"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "750f9a50-57dd-ea74-181c-402735e0595e" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R21"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "6ec3d399-7530-66fc-6987-8d01ec1338f0" -> null
      - input  = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
      - output = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
    }

  # module.tunnel_interfaces["CR4"].terraform_data.targets_hash["R9"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "eeea4bc0-d211-2f60-6478-63ba5a364e17" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R10"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "b7ce27ee-a254-48d6-82c3-9d4a313c2e72" -> null
      - input  = 19 -> null
      - output = 19 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R14"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "bab65e0d-f571-44b8-b86f-0ef41d4680d7" -> null
      - input  = 20 -> null
      - output = 20 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R15"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "a320db34-d0e1-47d7-8ab0-3a13799ac153" -> null
      - input  = 21 -> null
      - output = 21 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R18"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "c43ba172-8037-4429-af59-ea6521a3842b" -> null
      - input  = 24 -> null
      - output = 24 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R19"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "bcdbee33-fd21-41e6-81fc-f101e36a94a2" -> null
      - input  = 22 -> null
      - output = 22 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R20"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "85111592-1f46-ed10-c7af-d7b082b84710" -> null
      - input  = 30 -> null
      - output = 30 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R21"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "98153972-574a-92d4-5583-320601612820" -> null
      - input  = 32 -> null
      - output = 32 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.ifnum["R9"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "da73b074-a6c8-40dd-a00f-90506685fbe3" -> null
      - input  = 18 -> null
      - output = 18 -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R10"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "4fc6dcf4-22f0-0e72-75a9-cc0245440e15" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R14"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "ed3dbdde-8e3d-e2f6-cb1e-8ac670f75135" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R15"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "7db97fc4-7e27-00b4-dd09-f1563b0ab2f8" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R18"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "82c0f76a-e6f7-ac92-7387-5702193f4ebf" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R19"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "d66cdb61-c13a-90e9-b889-cbe11ccd2073" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R20"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "33afd8ca-36a8-6498-ed17-5f5313421dfc" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R21"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "c3a084ca-d7ae-9364-42bf-31400593af91" -> null
      - input  = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
      - output = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
    }

  # module.tunnel_interfaces["CR5"].terraform_data.targets_hash["R9"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "52e7c223-4d86-f72b-0ba9-61c26a427648" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R10"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "1a980a09-cb01-ef56-a501-3f086af211f7" -> null
      - input  = 1 -> null
      - output = 1 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R14"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "55d01a13-f205-630c-ff13-572cf1b6b122" -> null
      - input  = 2 -> null
      - output = 2 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R15"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "ce65a6be-f9ca-882b-df6f-ed8cb4035634" -> null
      - input  = 3 -> null
      - output = 3 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R18"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "95be1d55-e780-99de-51cf-c589aa2859b7" -> null
      - input  = 4 -> null
      - output = 4 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R19"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "db1170f2-be54-cb99-bb73-cb7b693524ea" -> null
      - input  = 5 -> null
      - output = 5 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R20"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "37a6be7d-947c-dd8f-30ef-c162c266e2dc" -> null
      - input  = 6 -> null
      - output = 6 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R21"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "4f8f7c1e-c56a-7b5b-c47e-b399311180c8" -> null
      - input  = 8 -> null
      - output = 8 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.ifnum["R9"] will be destroyed
  # (because terraform_data.ifnum is not in configuration)
  - resource "terraform_data" "ifnum" {
      - id     = "45d64d6f-33c1-b4d7-fef1-a6e4c9738eab" -> null
      - input  = 7 -> null
      - output = 7 -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R10"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "4c2d75cf-f73d-324f-986d-5f1827406c8c" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R14"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "0ef54cd3-21d5-4172-2613-7af34632d9b7" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R15"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "deafbdcd-9822-b6fc-1957-b7ec347c80a2" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R18"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "972fbcf1-e9ee-1364-d097-c4640384f272" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R19"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "36703946-91a8-6d91-27d0-9dba5f27352b" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R20"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "929ae8a1-a4f8-07f6-eb9c-4989dd853a18" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R21"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "3a686022-fe66-40bc-3847-f97aa1a36934" -> null
      - input  = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
      - output = "fcb5c9c7f4bd4c2b253c91d6cb2ced017f995d7e" -> null
    }

  # module.tunnel_interfaces["CR6"].terraform_data.targets_hash["R9"] will be destroyed
  # (because terraform_data.targets_hash is not in configuration)
  - resource "terraform_data" "targets_hash" {
      - id     = "ad2a7717-29ee-a626-1fc5-72337a69b6ba" -> null
      - input  = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
      - output = "06544f10a22d4d3c70f7439e79efea782670ef9d" -> null
    }

Plan: 8 to add, 32 to change, 64 to destroy.
```